GopalSaraf/Practicals/PSDL/include/proc/pic16f15256.inc
// Register: CPCON
#define CPCON CPCON
CPCON                                    equ 009Ah
// bitfield definitions
CPCON_CPRDY_POSN                         equ 0000h
CPCON_CPRDY_POSITION                     equ 0000h
CPCON_CPRDY_SIZE                         equ 0001h
CPCON_CPRDY_LENGTH                       equ 0001h
CPCON_CPRDY_MASK                         equ 0001h
CPCON_CPT_POSN                           equ 0001h
CPCON_CPT_POSITION                       equ 0001h
CPCON_CPT_SIZE                           equ 0001h
CPCON_CPT_LENGTH                         equ 0001h
CPCON_CPT_MASK                           equ 0002h
CPCON_CPON_POSN                          equ 0006h
CPCON_CPON_POSITION                      equ 0006h
CPCON_CPON_SIZE                          equ 0002h
CPCON_CPON_LENGTH                        equ 0002h
CPCON_CPON_MASK                          equ 00C0h

// Register: ADRESL
#define ADRESL ADRESL
ADRESL                                   equ 009Bh
// bitfield definitions
ADRESL_ADRESL_POSN                       equ 0000h
ADRESL_ADRESL_POSITION                   equ 0000h
ADRESL_ADRESL_SIZE                       equ 0008h
ADRESL_ADRESL_LENGTH                     equ 0008h
ADRESL_ADRESL_MASK                       equ 00FFh

// Register: ADRESH
#define ADRESH ADRESH
ADRESH                                   equ 009Ch
// bitfield definitions
ADRESH_ADRESH_POSN                       equ 0000h
ADRESH_ADRESH_POSITION                   equ 0000h
ADRESH_ADRESH_SIZE                       equ 0008h
ADRESH_ADRESH_LENGTH                     equ 0008h
ADRESH_ADRESH_MASK                       equ 00FFh

// Register: ADCON0
#define ADCON0 ADCON0
ADCON0                                   equ 009Dh
// bitfield definitions
ADCON0_ON_POSN                           equ 0000h
ADCON0_ON_POSITION                       equ 0000h
ADCON0_ON_SIZE                           equ 0001h
ADCON0_ON_LENGTH                         equ 0001h
ADCON0_ON_MASK                           equ 0001h
ADCON0_GO_POSN                           equ 0001h
ADCON0_GO_POSITION                       equ 0001h
ADCON0_GO_SIZE                           equ 0001h
ADCON0_GO_LENGTH                         equ 0001h
ADCON0_GO_MASK                           equ 0002h
ADCON0_CHS_POSN                          equ 0002h
ADCON0_CHS_POSITION                      equ 0002h
ADCON0_CHS_SIZE                          equ 0006h
ADCON0_CHS_LENGTH                        equ 0006h
ADCON0_CHS_MASK                          equ 00FCh
ADCON0_ADON_POSN                         equ 0000h
ADCON0_ADON_POSITION                     equ 0000h
ADCON0_ADON_SIZE                         equ 0001h
ADCON0_ADON_LENGTH                       equ 0001h
ADCON0_ADON_MASK                         equ 0001h
ADCON0_GO_nDONE_POSN                     equ 0001h
ADCON0_GO_nDONE_POSITION                 equ 0001h
ADCON0_GO_nDONE_SIZE                     equ 0001h
ADCON0_GO_nDONE_LENGTH                   equ 0001h
ADCON0_GO_nDONE_MASK                     equ 0002h
ADCON0_ADCHS_POSN                        equ 0002h
ADCON0_ADCHS_POSITION                    equ 0002h
ADCON0_ADCHS_SIZE                        equ 0006h
ADCON0_ADCHS_LENGTH                      equ 0006h
ADCON0_ADCHS_MASK                        equ 00FCh
ADCON0_ADGO_POSN                         equ 0001h
ADCON0_ADGO_POSITION                     equ 0001h
ADCON0_ADGO_SIZE                         equ 0001h
ADCON0_ADGO_LENGTH                       equ 0001h
ADCON0_ADGO_MASK                         equ 0002h

// Register: ADCON1
#define ADCON1 ADCON1
ADCON1                                   equ 009Eh
// bitfield definitions
ADCON1_PREF_POSN                         equ 0000h
ADCON1_PREF_POSITION                     equ 0000h
ADCON1_PREF_SIZE                         equ 0002h
ADCON1_PREF_LENGTH                       equ 0002h
ADCON1_PREF_MASK                         equ 0003h
ADCON1_CS_POSN                           equ 0004h
ADCON1_CS_POSITION                       equ 0004h
ADCON1_CS_SIZE                           equ 0003h
ADCON1_CS_LENGTH                         equ 0003h
ADCON1_CS_MASK                           equ 0070h
ADCON1_FM_POSN                           equ 0007h
ADCON1_FM_POSITION                       equ 0007h
ADCON1_FM_SIZE                           equ 0001h
ADCON1_FM_LENGTH                         equ 0001h
ADCON1_FM_MASK                           equ 0080h
ADCON1_ADPREF_POSN                       equ 0000h
ADCON1_ADPREF_POSITION                   equ 0000h
ADCON1_ADPREF_SIZE                       equ 0002h
ADCON1_ADPREF_LENGTH                     equ 0002h
ADCON1_ADPREF_MASK                       equ 0003h
ADCON1_ADCS_POSN                         equ 0004h
ADCON1_ADCS_POSITION                     equ 0004h
ADCON1_ADCS_SIZE                         equ 0003h
ADCON1_ADCS_LENGTH                       equ 0003h
ADCON1_ADCS_MASK                         equ 0070h
ADCON1_ADFM_POSN                         equ 0007h
ADCON1_ADFM_POSITION                     equ 0007h
ADCON1_ADFM_SIZE                         equ 0001h
ADCON1_ADFM_LENGTH                       equ 0001h
ADCON1_ADFM_MASK                         equ 0080h

// Register: ADACT
#define ADACT ADACT
ADACT                                    equ 009Fh
// bitfield definitions
ADACT_ACT_POSN                           equ 0000h
ADACT_ACT_POSITION                       equ 0000h
ADACT_ACT_SIZE                           equ 0004h
ADACT_ACT_LENGTH                         equ 0004h
ADACT_ACT_MASK                           equ 000Fh
ADACT_ADACT_POSN                         equ 0000h
ADACT_ADACT_POSITION                     equ 0000h
ADACT_ADACT_SIZE                         equ 0004h
ADACT_ADACT_LENGTH                       equ 0004h
ADACT_ADACT_MASK                         equ 000Fh

// Register: RB4I2C
#define RB4I2C RB4I2C
RB4I2C                                   equ 010Ch
// bitfield definitions
RB4I2C_TH_POSN                           equ 0000h
RB4I2C_TH_POSITION                       equ 0000h
RB4I2C_TH_SIZE                           equ 0002h
RB4I2C_TH_LENGTH                         equ 0002h
RB4I2C_TH_MASK                           equ 0003h
RB4I2C_PU_POSN                           equ 0004h
RB4I2C_PU_POSITION                       equ 0004h
RB4I2C_PU_SIZE                           equ 0002h
RB4I2C_PU_LENGTH                         equ 0002h
RB4I2C_PU_MASK                           equ 0030h
RB4I2C_SLEW_POSN                         equ 0006h
RB4I2C_SLEW_POSITION                     equ 0006h
RB4I2C_SLEW_SIZE                         equ 0001h
RB4I2C_SLEW_LENGTH                       equ 0001h
RB4I2C_SLEW_MASK                         equ 0040h

